blecon/blecon-device-sdk/ports/nrf5/src/blecon_nrf5_bluetooth.c
/*
 * Copyright (c) Blecon Ltd
 * SPDX-License-Identifier: Apache-2.0
 */

#include "blecon_nrf5_l2cap_server.h"
#include "blecon_nrf5_bluetooth.h"
#include "blecon_nrf5_crypto.h"
#include "blecon/blecon_bluetooth_types.h"
#include "blecon/blecon_error.h"
#include "blecon_nrf5_bluetooth_common.h"
#include "blecon_nrf5_gatts_bearer.h"

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_sdm.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "nrf_ble_gatt.h"
#include "nrf_log.h"
#include "app_timer.h"

#define APP_BLE_CONN_CFG_TAG 1 // Softdevice configuration identifier
#define APP_BLE_OBSERVER_PRIO 3 // Priority of our BLE observer

#define DEVICE_NAME "Blecon"

#define BLE_TX_POWER                        (0)
#define MIN_CONN_INTERVAL                   MSEC_TO_UNITS(15, UNIT_1_25_MS)        // 15ms target minimum connection interval
#define MAX_CONN_INTERVAL                   MSEC_TO_UNITS(15, UNIT_1_25_MS)        // 15ms target maximum connection interval
#define SLAVE_LATENCY                       0
#define CONN_SUP_TIMEOUT                    MSEC_TO_UNITS(4000, UNIT_10_MS)        // 4 seconds connection supervisory timeout

#define FIRST_CONN_PARAMS_UPDATE_DELAY      APP_TIMER_TICKS(5000)                   // Time from initiating event (connect or start of notification) to first time connection parameters are sent (5 seconds).
#define NEXT_CONN_PARAMS_UPDATE_DELAY       APP_TIMER_TICKS(30000)                  // Time between each connection parameters update (30 seconds).
#define MAX_CONN_PARAMS_UPDATE_COUNT        3                                       // Number of attempts before giving up the negotiation.

// Validate nRF5 SDK config
#if NRF_BLE_CONN_PARAMS_ENABLED != 1
#error "BLE Connection Parameters module must be enabled in the nRF5 SDK config"
#endif

static struct blecon_nrf5_bluetooth_t _nrf5_bluetooth;

APP_TIMER_DEF(_timer_id);

static void advertising_stop(struct blecon_nrf5_bluetooth_t* nrf5_bluetooth);
static void advertising_start(struct blecon_nrf5_bluetooth_t* nrf5_bluetooth);
static void softdevice_init(void);
static void ble_stack_init(void);
static void gap_params_init(void);
static void conn_params_init(void);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void adv_timeout_handler(void * p_context);

static void blecon_nrf5_bluetooth_setup(struct blecon_bluetooth_t* bluetooth);
static void blecon_nrf5_bluetooth_shutdown(struct blecon_bluetooth_t* bluetooth);
static struct blecon_bluetooth_advertising_set_t* blecon_nrf5_advertising_set_new(struct blecon_bluetooth_t* bluetooth);
static void blecon_nrf5_bluetooth_advertising_set_update_params(struct blecon_bluetooth_advertising_set_t* adv_set, struct blecon_bluetooth_advertising_params_t* params);
static void blecon_nrf5_bluetooth_advertising_set_update_data(struct blecon_bluetooth_advertising_set_t* adv_set, struct blecon_bluetooth_advertising_data_t* data);
static void blecon_nrf5_bluetooth_advertising_set_start(struct blecon_bluetooth_advertising_set_t* adv_set);
static void blecon_nrf5_bluetooth_advertising_set_stop(struct blecon_bluetooth_advertising_set_t* adv_set);
static void blecon_nrf5_bluetooth_advertising_set_free(struct blecon_bluetooth_advertising_set_t* adv_set);
static void blecon_nrf5_bluetooth_get_address(struct blecon_bluetooth_t* bluetooth, struct blecon_bluetooth_addr_t* bt_addr);
static void blecon_nrf5_bluetooth_connection_get_info(struct blecon_bluetooth_connection_t* connection, struct blecon_bluetooth_connection_info_t* info);
static void blecon_nrf5_bluetooth_connection_get_power_info(struct blecon_bluetooth_connection_t* connection, int8_t* tx_power, int8_t* rssi);
static void blecon_nrf5_bluetooth_connection_disconnect(struct blecon_bluetooth_connection_t* connection);
static void blecon_nrf5_bluetooth_connection_free(struct blecon_bluetooth_connection_t* connection);
static void blecon_nrf5_bluetooth_scan_start(struct blecon_bluetooth_t* bluetooth, struct blecon_bluetooth_phy_mask_t phy_mask);
static void blecon_nrf5_bluetooth_scan_stop(struct blecon_bluetooth_t* bluetooth);

struct blecon_bluetooth_t* blecon_nrf5_bluetooth_init(void) {
    static const struct blecon_bluetooth_fn_t bluetooth_fn = {
        .setup = blecon_nrf5_bluetooth_setup,
        .shutdown = blecon_nrf5_bluetooth_shutdown,
        .advertising_set_new = blecon_nrf5_advertising_set_new,
        .advertising_set_update_params = blecon_nrf5_bluetooth_advertising_set_update_params,
        .advertising_set_update_data = blecon_nrf5_bluetooth_advertising_set_update_data,
        .advertising_set_start = blecon_nrf5_bluetooth_advertising_set_start,
        .advertising_set_stop = blecon_nrf5_bluetooth_advertising_set_stop,
        .advertising_set_free = blecon_nrf5_bluetooth_advertising_set_free,
        .get_address = blecon_nrf5_bluetooth_get_address,
        .l2cap_server_new = blecon_nrf5_bluetooth_l2cap_server_new,
        .gatt_server_new = blecon_nrf5_bluetooth_gatt_server_new,
        .connection_get_info = blecon_nrf5_bluetooth_connection_get_info,
        .connection_get_power_info = blecon_nrf5_bluetooth_connection_get_power_info,
        .connection_disconnect = blecon_nrf5_bluetooth_connection_disconnect,
        .connection_get_l2cap_server_bearer = blecon_nrf5_bluetooth_connection_get_l2cap_server_bearer,
        .connection_get_gatt_server_bearer = blecon_nrf5_bluetooth_connection_get_gatt_server_bearer,
        .connection_free = blecon_nrf5_bluetooth_connection_free,
        .scan_start = blecon_nrf5_bluetooth_scan_start,
        .scan_stop = blecon_nrf5_bluetooth_scan_stop
    };

    blecon_bluetooth_init(&_nrf5_bluetooth.bluetooth, &bluetooth_fn);

    _nrf5_bluetooth.advertising.sets_count = 0;
    _nrf5_bluetooth.advertising.set_current = 0;
    _nrf5_bluetooth.advertising.set_next = 0;
    _nrf5_bluetooth.advertising.handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    _nrf5_bluetooth.advertising.sets_advertising = 0;

    _nrf5_bluetooth.connection.handle = BLE_CONN_HANDLE_INVALID;
    _nrf5_bluetooth.connection.phy = blecon_bluetooth_phy_1m;
    memset(&_nrf5_bluetooth.connection.our_bt_addr, 0, sizeof(_nrf5_bluetooth.connection.our_bt_addr));
    memset(&_nrf5_bluetooth.connection.peer_bt_addr, 0, sizeof(_nrf5_bluetooth.connection.peer_bt_addr));

    blecon_nrf5_bluetooth_gatt_server_init(&_nrf5_bluetooth);

#ifdef S140
    memset(&_nrf5_bluetooth.scan_params, 0, sizeof(_nrf5_bluetooth.scan_params));
    _nrf5_bluetooth.is_scanning = false;
#endif

    return &_nrf5_bluetooth.bluetooth;
}

void blecon_nrf5_bluetooth_setup(struct blecon_bluetooth_t* bluetooth) {
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = (struct blecon_nrf5_bluetooth_t*)bluetooth;

