blecon/blecon-device-sdk/ports/nrf5/src/blecon_nrf5_bluetooth.c
    // Initialize softdevice here
    softdevice_init();
    
    // Initialize BLE stack
    ble_stack_init();
    gap_params_init();
    conn_params_init();

    // Initialize GATT server module
    blecon_nrf5_bluetooth_gatt_server_setup(nrf5_bluetooth);
    
    // Create timer
    ret_code_t err_code = app_timer_create(&_timer_id,
    APP_TIMER_MODE_REPEATED, adv_timeout_handler);
    blecon_assert(err_code == NRF_SUCCESS);
}

void blecon_nrf5_bluetooth_shutdown(struct blecon_bluetooth_t* bluetooth) {

}

struct blecon_bluetooth_advertising_set_t* blecon_nrf5_advertising_set_new(struct blecon_bluetooth_t* bluetooth) {
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = (struct blecon_nrf5_bluetooth_t*)bluetooth;
    blecon_assert(nrf5_bluetooth->advertising.sets_count < BLECON_MAX_ADVERTISING_SETS);

    struct blecon_nrf5_bluetooth_advertising_set_t* adv_set = &nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.sets_count];
    nrf5_bluetooth->advertising.sets_count++;

    memset(&adv_set->params, 0, sizeof(struct blecon_bluetooth_advertising_params_t));
    memset(adv_set->data, 0, sizeof(adv_set->data));

    adv_set->data_sz = 0;
    adv_set->is_advertising = false;

    return &adv_set->set;
}

void blecon_nrf5_bluetooth_advertising_set_update_params(struct blecon_bluetooth_advertising_set_t* adv_set, struct blecon_bluetooth_advertising_params_t* params) {
    struct blecon_nrf5_bluetooth_advertising_set_t* nrf5_adv_set = (struct blecon_nrf5_bluetooth_advertising_set_t*)adv_set;

    // Update tx power
    params->tx_power = BLE_TX_POWER;

    // Save parameters
    nrf5_adv_set->params = *params;
}

void blecon_nrf5_bluetooth_advertising_set_update_data(struct blecon_bluetooth_advertising_set_t* adv_set, struct blecon_bluetooth_advertising_data_t* data) {
    struct blecon_nrf5_bluetooth_advertising_set_t* nrf5_adv_set = (struct blecon_nrf5_bluetooth_advertising_set_t*)adv_set;

    blecon_assert(data->data_sz <= sizeof(nrf5_adv_set->data));

    // Save data
    nrf5_adv_set->data_sz = data->data_sz;
    memcpy(nrf5_adv_set->data, data->data, data->data_sz);
}

void blecon_nrf5_bluetooth_advertising_set_start(struct blecon_bluetooth_advertising_set_t* adv_set) {
    struct blecon_nrf5_bluetooth_advertising_set_t* nrf5_adv_set = (struct blecon_nrf5_bluetooth_advertising_set_t*)adv_set;
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = (struct blecon_nrf5_bluetooth_t*)adv_set->bluetooth;
    if(nrf5_adv_set->is_advertising) {
        return;
    }
    nrf5_adv_set->is_advertising = true;

    nrf5_bluetooth->advertising.sets_advertising++;
    if(nrf5_bluetooth->advertising.sets_advertising > 1) {
        return; // Already advertising
    }
    nrf5_bluetooth->advertising.set_next = (nrf5_adv_set - nrf5_bluetooth->advertising.sets) / sizeof(struct blecon_nrf5_bluetooth_advertising_set_t);

    // Start timer
    ret_code_t err_code;
    err_code = app_timer_start(_timer_id, APP_TIMER_TICKS(nrf5_adv_set->params.interval_0_625ms * 1000 / 625), NULL);
    blecon_assert(err_code == NRF_SUCCESS);

    // Start advertising
    advertising_start(nrf5_bluetooth);    
}

void blecon_nrf5_bluetooth_advertising_set_stop(struct blecon_bluetooth_advertising_set_t* adv_set) {
    struct blecon_nrf5_bluetooth_advertising_set_t* nrf5_adv_set = (struct blecon_nrf5_bluetooth_advertising_set_t*)adv_set;
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = (struct blecon_nrf5_bluetooth_t*)adv_set->bluetooth;
    if(!nrf5_adv_set->is_advertising) {
        return;
    }
    nrf5_adv_set->is_advertising = false;
    blecon_assert(nrf5_bluetooth->advertising.sets_advertising > 0);
    nrf5_bluetooth->advertising.sets_advertising--;
    app_timer_stop(_timer_id);
    advertising_stop(nrf5_bluetooth);
    if( nrf5_bluetooth->advertising.sets_advertising > 0 ) {
        // Continue advertising
        advertising_start(nrf5_bluetooth);
    }
}

void blecon_nrf5_bluetooth_advertising_set_free(struct blecon_bluetooth_advertising_set_t* adv_set) {
    blecon_fatal_error(); // Not allowed
}

void blecon_nrf5_bluetooth_get_address(struct blecon_bluetooth_t* bluetooth, struct blecon_bluetooth_addr_t* bt_addr) {
    // Retrieve base MAC address from softdevice
    ble_gap_addr_t gap_addr = {0};
    ret_code_t err_code = sd_ble_gap_addr_get(&gap_addr);
    blecon_assert(err_code == NRF_SUCCESS);

    bt_addr->addr_type = gap_addr.addr_type;
    memcpy(bt_addr->bytes, gap_addr.addr, BLECON_BLUETOOTH_ADDR_SZ);
}

void blecon_nrf5_bluetooth_connection_get_info(struct blecon_bluetooth_connection_t* connection, struct blecon_bluetooth_connection_info_t* info) {
    struct blecon_nrf5_bluetooth_connection_t* nrf5_connection = (struct blecon_nrf5_bluetooth_connection_t*)connection;
    info->is_central = false; // We don't support the central role
    info->our_bt_addr = nrf5_connection->our_bt_addr;
    info->peer_bt_addr = nrf5_connection->peer_bt_addr;
    info->phy = nrf5_connection->phy;
}

void blecon_nrf5_bluetooth_connection_get_power_info(struct blecon_bluetooth_connection_t* connection, int8_t* tx_power, int8_t* rssi) {
    struct blecon_nrf5_bluetooth_connection_t* nrf5_connection = (struct blecon_nrf5_bluetooth_connection_t*)connection;
    *tx_power = BLE_TX_POWER;
    uint8_t ch_index = 0;
    ret_code_t err_code = sd_ble_gap_rssi_get(nrf5_connection->handle, rssi, &ch_index);
    blecon_assert(err_code == NRF_SUCCESS);
}

void blecon_nrf5_bluetooth_connection_disconnect(struct blecon_bluetooth_connection_t* connection) {
    struct blecon_nrf5_bluetooth_connection_t* nrf5_connection = (struct blecon_nrf5_bluetooth_connection_t*)connection; 
    if(nrf5_connection->handle == BLE_CONN_HANDLE_INVALID) {
        return;
    }
    
    ret_code_t err_code = sd_ble_gap_disconnect(nrf5_connection->handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    blecon_assert( (err_code == 0) || (err_code == NRF_ERROR_INVALID_STATE /* if disconnection was already triggered, but hasn't completed yet */) );
}

void blecon_nrf5_bluetooth_connection_free(struct blecon_bluetooth_connection_t* connection) {

