blecon/blecon-device-sdk/ports/nrf5/src/blecon_nrf5_bluetooth.c
}

void blecon_nrf5_bluetooth_scan_start(struct blecon_bluetooth_t* bluetooth, struct blecon_bluetooth_phy_mask_t phy_mask) {
#ifdef S140
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = (struct blecon_nrf5_bluetooth_t*)bluetooth;
    // Populate scan parameters
    nrf5_bluetooth->scan_params.extended = 1;
    nrf5_bluetooth->scan_params.report_incomplete_evts = 0;
    nrf5_bluetooth->scan_params.active = 0;
    nrf5_bluetooth->scan_params.filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL;
    nrf5_bluetooth->scan_params.scan_phys = 0;
    if(phy_mask.phy_1m) {
        nrf5_bluetooth->scan_params.scan_phys |= BLE_GAP_PHY_1MBPS;
    }
    if(phy_mask.phy_coded) {
        nrf5_bluetooth->scan_params.scan_phys |= BLE_GAP_PHY_CODED;
    }
    nrf5_bluetooth->scan_params.interval = 160; // 100ms
    if( (phy_mask.phy_1m) && (phy_mask.phy_coded) ) {
        nrf5_bluetooth->scan_params.window = 80; // Share scan window between 1M and Coded PHY
    } else {
        nrf5_bluetooth->scan_params.window = 80;
    }
    nrf5_bluetooth->scan_params.timeout = BLE_GAP_SCAN_TIMEOUT_UNLIMITED; // No timeout
    memset(nrf5_bluetooth->scan_params.channel_mask, 0, sizeof(nrf5_bluetooth->scan_params.channel_mask)); // Scan on all advertising channels

    ble_data_t adv_report_buffer = {
        .p_data = nrf5_bluetooth->scan_buffer,
        .len = sizeof(nrf5_bluetooth->scan_buffer)
    };

    ret_code_t err_code = sd_ble_gap_scan_start(&nrf5_bluetooth->scan_params, &adv_report_buffer);
    blecon_assert(err_code == NRF_SUCCESS);

    nrf5_bluetooth->is_scanning = true;

#else
    blecon_fatal_error(); // Not supported
#endif
}

void blecon_nrf5_bluetooth_scan_stop(struct blecon_bluetooth_t* bluetooth) {
#ifdef S140
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = (struct blecon_nrf5_bluetooth_t*)bluetooth;

    sd_ble_gap_scan_stop();

    nrf5_bluetooth->is_scanning = false;
#else
    blecon_fatal_error(); // Not supported
#endif
}

// Private functions
void advertising_stop(struct blecon_nrf5_bluetooth_t* nrf5_bluetooth) {
    sd_ble_gap_adv_stop(nrf5_bluetooth->advertising.handle);
}

void advertising_start(struct blecon_nrf5_bluetooth_t* nrf5_bluetooth) {
    const struct blecon_nrf5_bluetooth_advertising_set_t* adv_set = &nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.set_next];

    // Advertising parameters should only be set if advertising is not running
    ble_gap_adv_params_t adv_params = {0};

    // Advertising PDU
    if( adv_set->params.legacy_pdu ) {
        if(adv_set->params.is_connectable) {
            adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
        } else {
            adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
        }
    } else {
        #if S140
        if(adv_set->params.is_connectable) {
            adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
        } else {
            adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
        }
        #else
        blecon_fatal_error(); // Extended advertising not supported on other softdevices
        #endif
    }

    // Interval and duration
    adv_params.interval = BLE_GAP_ADV_INTERVAL_MAX;
    adv_params.duration = 0;
    adv_params.max_adv_evts = 1; // Always max 1 event
    // Tailgate all advertising sets

    // PHY
    #if BLECON_CODED_PHY
    if( adv_set->params.phy == blecon_bluetooth_phy_1m ) {
    #endif
        adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    #if BLECON_CODED_PHY
    } else {
        adv_params.primary_phy     = BLE_GAP_PHY_CODED;
    }
    #endif
    adv_params.secondary_phy = adv_params.primary_phy;

    // SID
    adv_params.set_id = adv_set->params.sid;
    
    ble_gap_adv_data_t ble_gap_adv_data = {0};
    ble_gap_adv_data.adv_data.p_data = (uint8_t*)adv_set->data;
    ble_gap_adv_data.adv_data.len = adv_set->data_sz;
    
    ret_code_t ret = sd_ble_gap_adv_set_configure(&nrf5_bluetooth->advertising.handle, &ble_gap_adv_data, &adv_params);
    blecon_assert(ret == NRF_SUCCESS);

    // Set TX power for this advertising handle
    ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, adv_set->params.tx_power, BLE_TX_POWER);
    blecon_assert(ret == NRF_SUCCESS);

    // Set advertising address
    ble_gap_addr_t addr = {0};
    addr.addr_type = adv_set->params.bt_addr.addr_type;
    memcpy(addr.addr, adv_set->params.bt_addr.bytes, BLECON_BLUETOOTH_ADDR_SZ);

#if S140
    // If we're scanning, we need to stop doing so before being able to set the advertising address
    if(nrf5_bluetooth->is_scanning) {
        sd_ble_gap_scan_stop();
    }
#endif

    do
    {
        ret = sd_ble_gap_addr_set(&addr);
    } while (ret == NRF_ERROR_INVALID_STATE);

#if S140
    // Resume scanning if needed
    if(nrf5_bluetooth->is_scanning) {
        ble_data_t adv_report_buffer = {
            .p_data = nrf5_bluetooth->scan_buffer,
            .len = sizeof(nrf5_bluetooth->scan_buffer)
        };

        ret_code_t err_code = sd_ble_gap_scan_start(&nrf5_bluetooth->scan_params, &adv_report_buffer);
        blecon_assert(err_code == NRF_SUCCESS);
    }
#endif

    // Save set number
    nrf5_bluetooth->advertising.set_current = nrf5_bluetooth->advertising.set_next;

    // Increment rotating advertising sets counter
    do {
        nrf5_bluetooth->advertising.set_next = (nrf5_bluetooth->advertising.set_next + 1) % nrf5_bluetooth->advertising.sets_count;
    } while( !nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.set_next].is_advertising );

    // Check that both advertising sets have the same interval
    blecon_assert(adv_set->params.interval_0_625ms == nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.set_next].params.interval_0_625ms);

    // Start advertising
    ret = sd_ble_gap_adv_start(nrf5_bluetooth->advertising.handle, APP_BLE_CONN_CFG_TAG);
    blecon_assert(ret == NRF_SUCCESS);
}

// Initialize softdevice and configure BLE parameters
void softdevice_init(void) 
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    blecon_assert(err_code == NRF_SUCCESS);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    blecon_assert(err_code == NRF_SUCCESS);

