blecon/blecon-device-sdk/ports/nrf5/src/blecon_nrf5_bluetooth.c
    // Configure L2CAP parameters
    ble_cfg_t ble_cfg;

    memset(&ble_cfg, 0x00, sizeof(ble_cfg));
    ble_cfg.conn_cfg.conn_cfg_tag                        = APP_BLE_CONN_CFG_TAG;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.rx_mps        = BLECON_NRF5_BLUETOOTH_L2CAP_MPS;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.rx_queue_size = BLECON_NRF5_BLUETOOTH_L2CAP_RX_BUF_MAX;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.tx_mps        = BLECON_NRF5_BLUETOOTH_L2CAP_MPS;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.tx_queue_size = BLECON_NRF5_BLUETOOTH_L2CAP_TX_BUF_MAX;
    ble_cfg.conn_cfg.params.l2cap_conn_cfg.ch_count      = BLECON_NRF5_BLUETOOTH_L2CAP_SERVERS_MAX;

    err_code = sd_ble_cfg_set(BLE_CONN_CFG_L2CAP, &ble_cfg, ram_start);
    blecon_assert(err_code == NRF_SUCCESS);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    blecon_assert(err_code == NRF_SUCCESS);
}

// Initialize BLE stack handler
void ble_stack_init(void)
{
    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

// Initialize GAP parameters
void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    blecon_assert(err_code == NRF_SUCCESS);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_TAG);
    blecon_assert(err_code == NRF_SUCCESS);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    blecon_assert(err_code == NRF_SUCCESS);
}

// Initialize preferred connection parameters
void conn_params_init(void)
{
    ret_code_t             err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = NULL;
    cp_init.error_handler                  = NULL;

    err_code = ble_conn_params_init(&cp_init);
    blecon_assert(err_code == NRF_SUCCESS);
}

// Handle BLE events
void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = &_nrf5_bluetooth;
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            // Init connection
            blecon_bluetooth_connection_init(&nrf5_bluetooth->connection.connection, &nrf5_bluetooth->bluetooth);

            nrf5_bluetooth->connection.handle = p_ble_evt->evt.gap_evt.conn_handle;

            // The connection's PHY is of the current advertising set
            nrf5_bluetooth->connection.phy = nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.set_current].params.phy;

            // Update addresses
            nrf5_bluetooth->connection.our_bt_addr = nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.set_current].params.bt_addr;
            nrf5_bluetooth->connection.peer_bt_addr.addr_type = p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr_type;
            memcpy(nrf5_bluetooth->connection.peer_bt_addr.bytes, p_ble_evt->evt.gap_evt.params.connected.peer_addr.addr, BLECON_BLUETOOTH_ADDR_SZ);
            
            // Enable RSSI reporting
            ret_code_t err_code = sd_ble_gap_rssi_start(nrf5_bluetooth->connection.handle, 1, 3);
            blecon_assert(err_code == NRF_SUCCESS);

            blecon_bluetooth_on_new_connection(&nrf5_bluetooth->bluetooth, &nrf5_bluetooth->connection.connection, &nrf5_bluetooth->advertising.sets[nrf5_bluetooth->advertising.set_current].set);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            nrf5_bluetooth->connection.handle = BLE_CONN_HANDLE_INVALID;
            blecon_bluetooth_connection_on_disconnected(&nrf5_bluetooth->connection.connection);
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            blecon_assert(err_code == NRF_SUCCESS);
        } 
        break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            blecon_assert(err_code == NRF_SUCCESS);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            blecon_assert(err_code == NRF_SUCCESS);
            break;

        case BLE_GAP_EVT_ADV_SET_TERMINATED:
            // Rotate advertising set unless this is the last set
            if((nrf5_bluetooth->advertising.sets_advertising > 0) && (nrf5_bluetooth->advertising.set_next != 0)) {
                // Stop - in case advertising was re-started 
                // before a pending set terminated event was processed
                advertising_stop(nrf5_bluetooth);
                advertising_start(nrf5_bluetooth);
            }
            break;
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
            // Handle data length update request
            {
                uint8_t data_length = p_ble_evt->evt.gap_evt.params.data_length_update_request.peer_params.max_tx_octets;
                if(data_length > NRF_SDH_BLE_GAP_DATA_LENGTH) {
                    // Use maximum supported data length
                    data_length = NRF_SDH_BLE_GAP_DATA_LENGTH;
                }

