blecon/blecon-device-sdk/ports/nrf5/src/blecon_nrf5_bluetooth.c
                ble_gap_data_length_params_t const dlp =
                {
                    .max_rx_octets  = data_length,
                    .max_tx_octets  = data_length,
                    .max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO,
                    .max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO,
                };

                ble_gap_data_length_limitation_t dll = {0};
                ret_code_t err_code = sd_ble_gap_data_length_update(p_ble_evt->evt.gap_evt.conn_handle, &dlp, &dll);
                blecon_assert(err_code == NRF_SUCCESS);
                break;
            }
        case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
            // Data length updated
            break;
#ifdef S140
        case BLE_GAP_EVT_ADV_REPORT:
            {
                if( p_ble_evt->evt.gap_evt.params.adv_report.type.status == BLE_GAP_ADV_DATA_STATUS_COMPLETE ) {
                    // Ignore incomplete or truncated data

                    ble_gap_evt_adv_report_t const * p_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;
                    struct blecon_bluetooth_advertising_info_t adv_info = {
                        .bt_addr.addr_type = p_adv_report->peer_addr.addr_type,
                        .legacy_pdu = !p_adv_report->type.extended_pdu,
                        .is_connectable = p_adv_report->type.connectable,
                        .sid = p_adv_report->type.extended_pdu ? p_adv_report->set_id : 0,
                        .tx_power = p_adv_report->tx_power,
                        .rssi = p_adv_report->rssi,
                        .phy = p_adv_report->primary_phy == BLE_GAP_PHY_1MBPS ? blecon_bluetooth_phy_1m : blecon_bluetooth_phy_coded,
                    };
                    memcpy(adv_info.bt_addr.bytes, p_adv_report->peer_addr.addr, BLECON_BLUETOOTH_ADDR_SZ);

                    struct blecon_bluetooth_advertising_data_t adv_data = {
                        .data = p_adv_report->data.p_data,
                        .data_sz = p_adv_report->data.len,
                    };
                    blecon_bluetooth_on_advertising_report(&nrf5_bluetooth->bluetooth, &adv_info, &adv_data);
                }

                // Continue scanning
                ble_data_t adv_report_buffer = {
                    .p_data = nrf5_bluetooth->scan_buffer,
                    .len = sizeof(nrf5_bluetooth->scan_buffer)
                };
                sd_ble_gap_scan_start(NULL, &adv_report_buffer);
            }
            break;
#endif
        default:
            // No implementation needed.
            break;
    }
}

void adv_timeout_handler(void * p_context) {
    struct blecon_nrf5_bluetooth_t* nrf5_bluetooth = &_nrf5_bluetooth;
    // Rotate advertising set
    // If next set is not 0, it means we had an overrun into the next slot
    // So wait for the next timeout event
    if((nrf5_bluetooth->advertising.sets_advertising > 0) && (nrf5_bluetooth->advertising.set_next == 0)) {
        // Stop - in case advertising was re-started 
        // before a pending timeout event was processed
        advertising_stop(nrf5_bluetooth);
        advertising_start(nrf5_bluetooth);
    }
}